App/InformationRegisters/ЦеныБлюд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЦеныБлюд</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Блюдо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

App/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Готовится</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереданКурьеру</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/Enums/СтатусыКурьеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыКурьеров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Свободен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Занят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНаСмене</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

App/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ресторан</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Рестораны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановоеВремяДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФактическоеВремяДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяДоставкиМинут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФотоДоставки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Блюдо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Блюда</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

App/CommonModules/УправлениеДоставкой/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Общий модуль серверной бизнес-логики доставки.
//
// Используется документом Заказ, обработкой АРМДиспетчера и формой справочника Блюда.
// Здесь сосредоточены правила, общие для нескольких мест вызова:
//   * актуальная цена блюда из регистра сведений ЦеныБлюд;
//   * назначение курьера на заказ и смена статуса заказа;
//   * пересчёт статуса доступности курьера по его очереди заказов;
//   * количество заказов курьера в очереди;
//   * расчёт времени доставки в минутах.
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

#Область ЦеныБлюд

// Возвращает цену блюда из среза последних записей регистра ЦеныБлюд на заданный момент времени.
//
// Параметры:
//   Блюдо   - СправочникСсылка.Блюда - блюдо, цену которого нужно получить;
//   Момент  - Дата                   - момент времени, на который определяется цена
//                                      (для документа это дата документа).
//
// Возвращаемое значение:
//   Число - цена блюда; 0, если цена на указанный момент не задана.
//
Функция ЦенаБлюдаНаДату(Блюдо, Момент) Экспорт

	Если Не ЗначениеЗаполнено(Блюдо) Тогда
		Возврат 0;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Момент) Тогда
		Момент = ТекущаяДатаСеанса();
	КонецЕсли;

	Отбор = Новый Структура("Блюдо", Блюдо);
	СрезПоследних = РегистрыСведений.ЦеныБлюд.ПолучитьПоследнее(Момент, Отбор);

	Если СрезПоследних = Неопределено Тогда
		Возврат 0;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(СрезПоследних.Цена) Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Окр(СрезПоследних.Цена, 2);

КонецФункции

// Возвращает самую позднюю цену блюда без привязки к моменту времени.
// Используется в карточке блюда для показа и установки текущей цены.
//
// Параметры:
//   Блюдо - СправочникСсылка.Блюда - блюдо.
//
// Возвращаемое значение:
//   Структура - Момент (Дата), Цена (Число), ЦенаЗадана (Булево).
//
Функция АктуальнаяЦенаБлюда(Блюдо) Экспорт

	Результат = Новый Структура("Момент, Цена, ЦенаЗадана", Дата(1, 1, 1), 0, Ложь);

	Если Не ЗначениеЗаполнено(Блюдо) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЦеныБлюд.Период КАК Период,
		|	ЦеныБлюд.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.ЦеныБлюд КАК ЦеныБлюд
		|ГДЕ
		|	ЦеныБлюд.Блюдо = &Блюдо
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦеныБлюд.Период УБЫВ";

	Запрос.УстановитьПараметр("Блюдо", Блюдо);

	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат.Момент     = Выборка.Период;
		Результат.Цена       = Окр(Выборка.Цена, 2);
		Результат.ЦенаЗадана = Истина;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Записывает цену блюда в регистр сведений ЦеныБлюд.
//
// Параметры:
//   Блюдо  - СправочникСсылка.Блюда - блюдо;
//   Цена   - Число                   - новая цена;
//   Момент - Дата                    - дата, с которой действует цена
//                                      (пустая - текущая дата сеанса).
//
Процедура УстановитьЦенуБлюда(Блюдо, Цена, Момент = Неопределено) Экспорт

	Если Не ЗначениеЗаполнено(Блюдо) Тогда
		ВызватьИсключение НСтр("ru = 'Не указано блюдо, для которого устанавливается цена.'");
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Момент) Тогда
		Момент = ТекущаяДатаСеанса();
	КонецЕсли;

	НаборЗаписей = РегистрыСведений.ЦеныБлюд.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Блюдо.Установить(Блюдо);
	НаборЗаписей.Отбор.Период.Установить(Момент);
	НаборЗаписей.Прочитать();

	Если НаборЗаписей.Количество() > 0 Тогда
		Запись = НаборЗаписей[0];
	Иначе
		Запись = НаборЗаписей.Добавить();
		Запись.Период = Момент;
		Запись.Блюдо  = Блюдо;
	КонецЕсли;

	Запись.Цена = Окр(Цена, 2);

	НаборЗаписей.Записать(Истина);

КонецПроцедуры

#КонецОбласти

#Область КурьерыИЗаказы

// Назначает курьера на заказ из АРМ диспетчера: заказ переводится в статус
// ПереданКурьеру, курьер - в статус Занят. Предыдущий курьер заказа (если был)
// освобождается, когда у него не осталось других заказов в работе.
//
// Параметры:
//   ЗаказСсылка  - ДокументСсылка.Заказ       - заказ;
//   КурьерСсылка - СправочникСсылка.Курьеры   - курьер.
//
Процедура НазначитьКурьераНаЗаказ(ЗаказСсылка, КурьерСсылка) Экспорт

	Если Не ЗначениеЗаполнено(ЗаказСсылка) Или Не ЗначениеЗаполнено(КурьерСсылка) Тогда
		ВызватьИсключение НСтр("ru = 'Для назначения курьера нужно выбрать заказ и курьера.'");
	КонецЕсли;

	ЗаказОбъект = ЗаказСсылка.ПолучитьОбъект();
	Если ЗаказОбъект = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Заказ не найден.'");
	КонецЕсли;

	Если ЗаказОбъект.Статус = Перечисления.СтатусыЗаказов.Доставлен
		Или ЗаказОбъект.Статус = Перечисления.СтатусыЗаказов.Отменен Тогда

		ВызватьИсключение НСтр("ru = 'Нельзя назначить курьера на доставленный или отмененный заказ.'");

	КонецЕсли;

	ПредыдущийКурьер = ЗаказОбъект.Курьер;

	ЗаказОбъект.Курьер = КурьерСсылка;
	ЗаказОбъект.Статус = Перечисления.СтатусыЗаказов.ПереданКурьеру;

	Если Не ЗначениеЗаполнено(ЗаказОбъект.ФактическоеВремяДоставки)
		И Не ЗначениеЗаполнено(ЗаказОбъект.ПлановоеВремяДоставки) Тогда
		ЗаказОбъект.ПлановоеВремяДоставки = ПлановоеВремяДоставкиПоУмолчанию(ЗаказОбъект.ДатаСоздания);
	КонецЕсли;

	ЗаказОбъект.Записать();

	// Отказ в обработчике ПередЗаписью не всегда приводит к исключению, поэтому
	// результат проверяем по данным базы.
	Если ЗаказОбъект.Ссылка.Курьер <> КурьерСсылка
		Или ЗаказОбъект.Ссылка.Статус <> Перечисления.СтатусыЗаказов.ПереданКурьеру Тогда

		ВызватьИсключение НСтр("ru = 'Не удалось передать заказ курьеру. Проверьте заполнение клиента, ресторана и состава заказа.'");

	КонецЕсли;

	// Курьер, принявший заказ, занят.
	УстановитьСтатусКурьера(КурьерСсылка, Перечисления.СтатусыКурьеров.Занят);

	// Прежнего курьера освобождаем, если у него не осталось заказов в работе.
	Если ЗначениеЗаполнено(ПредыдущийКурьер) И ПредыдущийКурьер <> КурьерСсылка Тогда
		ОбновитьСтатусКурьера(ПредыдущийКурьер);
	КонецЕсли;

КонецПроцедуры

// Пересчитывает статус доступности курьера по его очереди заказов.
// Если у курьера остались незавершенные заказы - он занят, иначе освобождается.
// Статус НеНаСмене не меняется: курьер не на смене, даже если заказов нет.
//
// Параметры:
//   КурьерСсылка - СправочникСсылка.Курьеры - курьер.
//
Процедура ОбновитьСтатусКурьера(КурьерСсылка) Экспорт

	Если Не ЗначениеЗаполнено(КурьерСсылка) Тогда
		Возврат;
	КонецЕсли;

	ТекущийСтатус = КурьерСсылка.ТекущийСтатус;

	Если ТекущийСтатус = Перечисления.СтатусыКурьеров.НеНаСмене Тогда
		Возврат;
	КонецЕсли;

	НовыйСтатус = Перечисления.СтатусыКурьеров.Свободен;
	Если КоличествоЗаказовВОчереди(КурьерСсылка) > 0 Тогда
		НовыйСтатус = Перечисления.СтатусыКурьеров.Занят;
	КонецЕсли;

	УстановитьСтатусКурьера(КурьерСсылка, НовыйСтатус);

КонецПроцедуры

// Записывает статус курьера, если он отличается от текущего.
//
// Параметры:
//   КурьерСсылка - СправочникСсылка.Курьеры         - курьер;
//   Статус       - ПеречислениеСсылка.СтатусыКурьеров - новый статус.
//
Процедура УстановитьСтатусКурьера(КурьерСсылка, Статус) Экспорт

	Если Не ЗначениеЗаполнено(КурьерСсылка) Тогда
		Возврат;
	КонецЕсли;

	Если КурьерСсылка.ТекущийСтатус = Статус Тогда
		Возврат;
	КонецЕсли;

	КурьерОбъект = КурьерСсылка.ПолучитьОбъект();
	КурьерОбъект.ТекущийСтатус = Статус;
	КурьерОбъект.Записать();

КонецПроцедуры

// Возвращает количество заказов курьера в очереди: все заказы, по которым
// доставка ещё не завершена (кроме доставленных и отменённых).
//
// Параметры:
//   КурьерСсылка - СправочникСсылка.Курьеры - курьер.
//
// Возвращаемое значение:
//   Число - количество заказов в очереди.
//
Функция КоличествоЗаказовВОчереди(КурьерСсылка) Экспорт

	Если Не ЗначениеЗаполнено(КурьерСсылка) Тогда
		Возврат 0;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(Заказ.Ссылка) КАК КоличествоЗаказов
		|ИЗ
		|	Документ.Заказ КАК Заказ
		|ГДЕ
		|	Заказ.Курьер = &Курьер
		|	И Заказ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказов.Доставлен)
		|	И Заказ.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказов.Отменен)";

	Запрос.УстановитьПараметр("Курьер", КурьерСсылка);

	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();

	Возврат Выборка.КоличествоЗаказов;

КонецФункции

#КонецОбласти

#Область ВремяДоставки

// Рассчитывает время доставки заказа в минутах.
//
// Параметры:
//   ДатаСоздания            - Дата - момент оформления заказа;
//   ФактическоеВремяДоставки - Дата - момент завершения доставки.
//
// Возвращаемое значение:
//   Число - целое количество минут доставки; 0, если данные не заполнены
//           или доставка завершилась раньше оформления заказа.
//
Функция МинутыДоставки(ДатаСоздания, ФактическоеВремяДоставки) Экспорт

	Если Не ЗначениеЗаполнено(ДатаСоздания) Или Не ЗначениеЗаполнено(ФактическоеВремяДоставки) Тогда
		Возврат 0;
	КонецЕсли;

	РазницаВСекундах = ФактическоеВремяДоставки - ДатаСоздания;

	Если РазницаВСекундах <= 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Окр(РазницаВСекундах / 60, 0);

КонецФункции

// Возвращает плановое время доставки для нового заказа.
//
// Параметры:
//   ДатаСоздания - Дата - момент оформления заказа.
//
// Возвращаемое значение:
//   Дата - плановое время доставки.
//
Функция ПлановоеВремяДоставкиПоУмолчанию(ДатаСоздания) Экспорт

	Если Не ЗначениеЗаполнено(ДатаСоздания) Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;

	// Типовой норматив доставки по городу - 60 минут с момента оформления заказа.
	Возврат ДатаСоздания + 60 * 60;

КонецФункции

#КонецОбласти

#Область Проверки

// Проверяет, что все блюда состава заказа относятся к ресторану заказа.
//
// Параметры:
//   Ресторан - СправочникСсылка.Рестораны - ресторан заказа;
//   Состав   - ТабличнаяЧасть.Состав, Массив - строки состава заказа.
//
// Возвращаемое значение:
//   Структура - Результат (Булево), Строка (Число), Блюдо (СправочникСсылка.Блюда).
//
Функция СоставСоответствуетРесторану(Ресторан, Состав) Экспорт

	Результат = Новый Структура("Результат, Строка, Блюдо", Истина, 0, Неопределено);

	Если Не ЗначениеЗаполнено(Ресторан) Тогда
		Возврат Результат;
	КонецЕсли;

	НомерСтроки = 0;
	Для Каждого СтрокаСостава Из Состав Цикл
		НомерСтроки = НомерСтроки + 1;

		Если Не ЗначениеЗаполнено(СтрокаСостава.Блюдо) Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаСостава.Блюдо.Ресторан <> Ресторан Тогда
			Результат.Результат = Ложь;
			Результат.Строка    = НомерСтроки;
			Результат.Блюдо     = СтрокаСостава.Блюдо;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти
